# Pandas 기초

## Pandas 는 Series data type 과 DataFrame data type 으로 구성

### Series (1 차원) : numpy array 와 유사. 
- 차이점 - numpy 와 달리 Series 는 axis (행, 열)에 label 을 부여할 수 있습니다. 즉, numpy 와 같이 숫자로만 indexing 하는 것이 아니라 label 명으로 indexing 을 할 수 있습니다. 또한 숫자 뿐 아니라 임의의 Python object 를 모두 element 로 가질 수 있습니다.

### DataFrame (2차원, table)
- Python program 안의 Excel

### Series vs DataFrame
<img src="series-and-dataframe.width-1200.png" width="600">

<img src="base_01_pandas_5_0.png" width="600">

In [2]:
import numpy as np
import pandas as pd

### Series 생성

- list, numpy array, dictionary 를 모두 Series 로 변환할 수 있습니다. 
- dictionary 의 경우 key 가 label, value 가 value 로 번환됩니다.

dictionary를 이용한 series 생성

In [3]:
dict = {'a': 10, 'b': 20, 'c': 30, 'd': 40}

series1 = pd.Series(dict)    # dictionary
series1

a    10
b    20
c    30
d    40
dtype: int64

list를 이용한 series 생성

In [4]:
my_list = [10, 20, 30, 40]
labels = ['a', 'b', 'c', 'd']

series2 = pd.Series(data = my_list, index = labels)     # list
series2

a    10
b    20
c    30
d    40
dtype: int64

numpy array를 이용한 series 생성

In [4]:
arr = np.array([10, 20, 30, 40])

series3 = pd.Series(arr)      # numpy array
series3

0    10
1    20
2    30
3    40
dtype: int32

### Series 의 indexing

index value를 이용한 indexing

In [5]:
series1['b':'c']

b    20
c    30
dtype: int64

index 순서를 이용한 indexing

In [6]:
series3[1:3]

1    20
2    30
dtype: int32

### Series  간의 연산

위에서 생성한 series 간의 덧샘을 해 봅니다.

In [5]:
series1, series2

(a    10
 b    20
 c    30
 d    40
 dtype: int64,
 a    10
 b    20
 c    30
 d    40
 dtype: int64)

In [6]:
series1 + series2

a    20
b    40
c    60
d    80
dtype: int64

### DataFrame 

DataFrame 은 여러개의 Series 를 같은 index 기준으로 모아 Table 을 만든 것 입니다.

DataFrame의 데이터로 사용할 random 숫자를 생성합니다. numpy의 정규분포 생성 함수를 이용하여 (5, 4) shape의 array를 생성합니다.

In [9]:
np.random.seed(101)

data = np.random.randn(5, 4)
data[0, 0], data[-1, 0] = 100, 100
data

array([[100.        ,   0.62813271,   0.90796945,   0.50382575],
       [  0.65111795,  -0.31931804,  -0.84807698,   0.60596535],
       [ -2.01816824,   0.74012206,   0.52881349,  -0.58900053],
       [  0.18869531,  -0.75887206,  -0.93323722,   0.95505651],
       [100.        ,   1.97875732,   2.60596728,   0.68350889]])

생성한 데이터를 이용하여  DataFrame을 생성합니다. Index 값과 column 명을 지정하여 생성합니다.

In [10]:
df = pd.DataFrame(data, index=['A', 'B', 'C', 'D', 'E'], 
                                        columns=['W', 'X', 'Y', 'Z'])
df

            W         X         Y         Z
A  100.000000  0.628133  0.907969  0.503826
B    0.651118 -0.319318 -0.848077  0.605965
C   -2.018168  0.740122  0.528813 -0.589001
D    0.188695 -0.758872 -0.933237  0.955057
E  100.000000  1.978757  2.605967  0.683509

dataframe 의 column 명

In [11]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

column 별 unique value 의 갯수

In [12]:
df.nunique()

W    4
X    5
Y    5
Z    5
dtype: int64

특정 column의 value별로 갯수를 count 합니다.

In [13]:
df['W'].value_counts()

 100.000000    2
 0.651118      1
-2.018168      1
 0.188695      1
Name: W, dtype: int64

다음은 df.info()가 제공하는 정보에 대한 분석입니다:

행 수: 데이터프레임의 행 수입니다.  
열 수: 데이터 프레임의 열 수입니다.  
열 이름: 데이터프레임에 있는 열의 이름입니다.  
개수: 데이터프레임의 각 열에 있는 널이 아닌 값의 수입니다.  
데이터 유형: 데이터 프레임에 있는 각 열의 데이터 유형입니다.  
메모리 사용량: 데이터프레임에서 사용하는 메모리 양입니다.

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

DataFrame의 기술통계를 제공합니다.

In [14]:
df.describe()

                W         X         Y         Z
count    5.000000  5.000000  5.000000  5.000000
mean    39.764329  0.453764  0.452287  0.431871
std     54.996644  1.061385  1.454516  0.594708
min     -2.018168 -0.758872 -0.933237 -0.589001
25%      0.188695 -0.319318 -0.848077  0.503826
50%      0.651118  0.628133  0.528813  0.605965
75%    100.000000  0.740122  0.907969  0.683509
max    100.000000  1.978757  2.605967  0.955057

### DataFrame indexing

In [15]:
df['W']

A    100.000000
B      0.651118
C     -2.018168
D      0.188695
E    100.000000
Name: W, dtype: float64

한개의 column은 Series 객체를 반환합니다.

In [29]:
type(df['W'])

pandas.core.series.Series

2개 이상의 column을 선택하면 DataFrame을 반환합니다.

In [16]:
df[['W', 'Z']]

            W         Z
A  100.000000  0.503826
B    0.651118  0.605965
C   -2.018168 -0.589001
D    0.188695  0.955057
E  100.000000  0.683509

특정 column을 지정하는 또다른 표현 방법입니다.

In [17]:
df.W

A    100.000000
B      0.651118
C     -2.018168
D      0.188695
E    100.000000
Name: W, dtype: float64

### 조건에 따른 slicing

boolean indexing이 가능합니다.

In [18]:
df[df['W'] > 0]

            W         X         Y         Z
A  100.000000  0.628133  0.907969  0.503826
B    0.651118 -0.319318 -0.848077  0.605965
D    0.188695 -0.758872 -0.933237  0.955057
E  100.000000  1.978757  2.605967  0.683509

In [19]:
df[(df['W'] > 0) | (df['Y'] > 0)]

            W         X         Y         Z
A  100.000000  0.628133  0.907969  0.503826
B    0.651118 -0.319318 -0.848077  0.605965
C   -2.018168  0.740122  0.528813 -0.589001
D    0.188695 -0.758872 -0.933237  0.955057
E  100.000000  1.978757  2.605967  0.683509

### index values

In [20]:
df.index.values

array(['A', 'B', 'C', 'D', 'E'], dtype=object)

### new column 추가/삭제

In [21]:
df['new'] = df['W'] + df['X']
df

            W         X         Y         Z         new
A  100.000000  0.628133  0.907969  0.503826  100.628133
B    0.651118 -0.319318 -0.848077  0.605965    0.331800
C   -2.018168  0.740122  0.528813 -0.589001   -1.278046
D    0.188695 -0.758872 -0.933237  0.955057   -0.570177
E  100.000000  1.978757  2.605967  0.683509  101.978757

In [22]:
df.drop('new', axis=1)

            W         X         Y         Z
A  100.000000  0.628133  0.907969  0.503826
B    0.651118 -0.319318 -0.848077  0.605965
C   -2.018168  0.740122  0.528813 -0.589001
D    0.188695 -0.758872 -0.933237  0.955057
E  100.000000  1.978757  2.605967  0.683509

원본 data는 update 되지 않았습니다.

In [24]:
df

            W         X         Y         Z         new
A  100.000000  0.628133  0.907969  0.503826  100.628133
B    0.651118 -0.319318 -0.848077  0.605965    0.331800
C   -2.018168  0.740122  0.528813 -0.589001   -1.278046
D    0.188695 -0.758872 -0.933237  0.955057   -0.570177
E  100.000000  1.978757  2.605967  0.683509  101.978757

inplace=True는 원본 데이터를 update 합니다.

In [25]:
df.drop('new', axis=1, inplace=True)
df

            W         X         Y         Z
A  100.000000  0.628133  0.907969  0.503826
B    0.651118 -0.319318 -0.848077  0.605965
C   -2.018168  0.740122  0.528813 -0.589001
D    0.188695 -0.758872 -0.933237  0.955057
E  100.000000  1.978757  2.605967  0.683509

In [26]:
df.drop('D', axis=0, inplace=True)
df

            W         X         Y         Z
A  100.000000  0.628133  0.907969  0.503826
B    0.651118 -0.319318 -0.848077  0.605965
C   -2.018168  0.740122  0.528813 -0.589001
E  100.000000  1.978757  2.605967  0.683509

In [27]:
df.shape

(4, 4)

### Dictionary Example
dictionary를 이용여 DataFrame을  생성합니다. dictionary의 key가 column 명이 되고 value가 column의 value가 됩니다.

In [28]:
songs = {"book": ["춘향전", "무기여 잘있거라", "소나기", "해리포터", "왕좌의 게임", "알고리즘파이썬"],
               "year": [1600, 1930, 1940, 1990, 2000, 2010],
              "pages": [50, 100, 100, 1000, 2000, 300]}

songs_df = pd.DataFrame(songs)
songs_df

       book  year  pages
0       춘향전  1600     50
1  무기여 잘있거라  1930    100
2       소나기  1940    100
3      해리포터  1990   1000
4    왕좌의 게임  2000   2000
5   알고리즘파이썬  2010    300

- page 가 많은 순서로 sort

In [29]:
songs_df.sort_values('pages', ascending=False, inplace=True)
songs_df

       book  year  pages
4    왕좌의 게임  2000   2000
3      해리포터  1990   1000
5   알고리즘파이썬  2010    300
1  무기여 잘있거라  1930    100
2       소나기  1940    100
0       춘향전  1600     50

book 과 year column 만 선택하여 새로운 DataFrame 을 생성합니다.

In [30]:
y = songs_df[['book', 'year']]
y

       book  year
4    왕좌의 게임  2000
3      해리포터  1990
5   알고리즘파이썬  2010
1  무기여 잘있거라  1930
2       소나기  1940
0       춘향전  1600

index 순서를 이용하여 slicing합니다.

In [32]:
songs_df.iloc[1:3, 0:2]

      book  year
3     해리포터  1990
5  알고리즘파이썬  2010

In [33]:
songs_df.iloc[1:3, :]

      book  year  pages
3     해리포터  1990   1000
5  알고리즘파이썬  2010    300

In [34]:
songs_df.iloc[1,1]

1990

### Missing Data 처리

- missing data 가 있는 row 혹은 columns 을 완전히 삭제 : dropna()
- 임의의 data 로 대체 : fillna()

In [35]:
df = pd.DataFrame({'A': [1, 2, np.nan],
                                'B': [5, np.nan, np.nan],
                                'C': [1, 2, 3]})

In [36]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

missing value 를 포함하고 있는 모든 row 삭제 - default

In [51]:
df.dropna()

     A    B  C
0  1.0  5.0  1

axis=1은 열을 기준으로 하여 missing value 를 포함하고 있는 모든 column을 삭제합니다.

In [37]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

### missing value 대체

특정 값으로 채워줍니다.

In [53]:
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

평균값으로 채워줍니다.

In [38]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64